In [11]:
import pandas as pd
import numpy as np
from sklearn.feature_extraction import DictVectorizer
from sklearn.feature_extraction.text import HashingVectorizer
from sklearn.linear_model import Perceptron

# **Loading data set**

In [12]:
df = pd.read_csv('C:\\Users\\DELL\\OneDrive\\Bureau\\M2-RFIA\\Text Mining\\TP\\text-mining\\data\\bbc-text.csv', encoding='utf-8')
df = df[:100000]
df.head()

        category                                               text
0           tech  tv future in the hands of viewers with home th...
1       business  worldcom boss  left books alone  former worldc...
2          sport  tigers wary of farrell  gamble  leicester say ...
3          sport  yeading face newcastle in fa cup premiership s...
4  entertainment  ocean s twelve raids box office ocean s twelve...

In [13]:
df.isnull().sum()

category    0
text        0
dtype: int64

In [19]:
df = df.fillna(method='ffill')

## We have 5 category that contain 2126 unique words.

In [24]:
df['category'].nunique(), df.text.nunique()

(5, 2126)

In [25]:
df.head()

        category                                               text
0           tech  tv future in the hands of viewers with home th...
1       business  worldcom boss  left books alone  former worldc...
2          sport  tigers wary of farrell  gamble  leicester say ...
3          sport  yeading face newcastle in fa cup premiership s...
4  entertainment  ocean s twelve raids box office ocean s twelve...

In [27]:
df.groupby('text').size().reset_index(name='counts')

                                                   text  counts
0     $1m payoff for former shell boss shell is to p...       1
1     &#163;1.8m indecency fine for viacom media gia...       1
2     2004: an irish athletics year 2004 won t be re...       1
3     2d metal slug offers retro fun like some drill...       2
4     a decade of good website design the web looks ...       1
...                                                 ...     ...
2121  yukos seeks court action on sale yukos will re...       1
2122  yukos sues four firms for $20bn russian oil fi...       1
2123  yukos unit buyer faces loan claim the owners o...       1
2124  yukos unit fetches $9bn at auction a little-kn...       1
2125  zambia confident and cautious zambia s technic...       1

[2126 rows x 2 columns]

In [28]:
X = df.drop('category', axis=1)
X.head()

                                                text
0  tv future in the hands of viewers with home th...
1  worldcom boss  left books alone  former worldc...
2  tigers wary of farrell  gamble  leicester say ...
3  yeading face newcastle in fa cup premiership s...
4  ocean s twelve raids box office ocean s twelve...